Revit 2026 API

# StructuralType Enumeration

---

Represents the structural type of a family instance.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StructuralType
```
```vb
Public Enumeration StructuralType
```
```cpp
public enum class StructuralType
```
```fsharp
type StructuralType
```

| Member name | Value | Description |
| --- | --- | --- |
| Beam | 1 | Structural Beam |
| Brace | 2 | Structural Brace |
| Column | 3 | Structural Column |
| Footing | 4 | Structural Footing |
| NonStructural | 0 | Non-Structural |
| UnknownFraming | 5 | Unknown Framing |

#### Reference

Autodesk.Revit.DB.Structure Namespace